In [2]:
!wget http://archive.ics.uci.edu/ml/machine-learning-databases/00352/Online%20Retail.xlsx

--2021-11-18 03:17:37--  http://archive.ics.uci.edu/ml/machine-learning-databases/00352/Online%20Retail.xlsx
Resolving archive.ics.uci.edu (archive.ics.uci.edu)... 128.195.10.252
Connecting to archive.ics.uci.edu (archive.ics.uci.edu)|128.195.10.252|:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 23715344 (23M) [application/x-httpd-php]
Saving to: ‘Online Retail.xlsx’

Online Retail.xlsx  100%[===================>]  22.62M  5.61MB/s    in 5.8s

2021-11-18 03:17:43 (3.91 MB/s) - ‘Online Retail.xlsx’ saved [23715344/23715344]

**Data Description:**

>Variable | Definition
>--- | ---
>InvoiceNo | Invoice number. Nominal, a 6-digit integral number uniquely assigned to each transaction. If this code starts with letter 'c', it indicates a cancellation.
>StockCode | Product (item) code. Nominal, a 5-digit integral number uniquely assigned to each distinct product.
>Description | Product (item) name. Nominal.
>Quantity | The quantities of each product (item) per transaction. Numeric.
>InvoiceDate | Invice Date and time. Numeric, the day and time when each transaction was generated.
>UnitPrice | Unit price. Numeric, Product price per unit in sterling.
>CustomerID | Customer number. Nominal, a 5-digit integral number uniquely assigned to each customer.
>Country | Country name. Nominal, the name of the country where each customer resides.

In [3]:
import pandas as pd

In [17]:
#Lectura del dataset
file_name = "Online Retail.xlsx"

sheet_name = "Online Retail"

#El método "read_excel" nos permite leer un excel con formato xlsx
dataset = pd.read_excel(file_name, sheet_name, index_col=None)

In [19]:
#Tamaño del dataset
dataset.shape

(541909, 8)

In [22]:
dataset.dtypes

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID            float64
Country                object
dtype: object

In [6]:
#Vemos las primeras filas del dataset
dataset.head()
dataset.tail()

       InvoiceNo StockCode  ... CustomerID  Country
541904    581587     22613  ...    12680.0   France
541905    581587     22899  ...    12680.0   France
541906    581587     23254  ...    12680.0   France
541907    581587     23255  ...    12680.0   France
541908    581587     22138  ...    12680.0   France

[5 rows x 8 columns]

## ● Obtenga los registros (filas) cuyo "Description" sea igual a "WHITE METAL LANTERN"

In [23]:
dataset.loc[dataset["Description"]=="WHITE METAL LANTERN"]

       InvoiceNo StockCode  ... CustomerID         Country
1         536365     71053  ...    17850.0  United Kingdom
50        536373     71053  ...    17850.0  United Kingdom
67        536375     71053  ...    17850.0  United Kingdom
279       536396     71053  ...    17850.0  United Kingdom
417       536406     71053  ...    17850.0  United Kingdom
...          ...       ...  ...        ...             ...
467347    576339     71053  ...    14096.0  United Kingdom
468547    576513     71053  ...    14715.0  United Kingdom
471383    576642     71053  ...    12963.0  United Kingdom
471907    576654     71053  ...    15584.0  United Kingdom
475528    576899     71053  ...    14911.0            EIRE

[328 rows x 8 columns]

## ● Obtenga los registros (filas) cuyo "Description" no sea igual a "WHITE METAL LANTERN"

In [24]:
dataset.loc[dataset["Description"]!="WHITE METAL LANTERN"]

       InvoiceNo StockCode  ... CustomerID         Country
1         536365     71053  ...    17850.0  United Kingdom
50        536373     71053  ...    17850.0  United Kingdom
67        536375     71053  ...    17850.0  United Kingdom
279       536396     71053  ...    17850.0  United Kingdom
417       536406     71053  ...    17850.0  United Kingdom
...          ...       ...  ...        ...             ...
467347    576339     71053  ...    14096.0  United Kingdom
468547    576513     71053  ...    14715.0  United Kingdom
471383    576642     71053  ...    12963.0  United Kingdom
471907    576654     71053  ...    15584.0  United Kingdom
475528    576899     71053  ...    14911.0            EIRE

[328 rows x 8 columns]

## ● Obtenga los registros (filas) cuyo "InvoiceNo" sea un número

In [28]:
dataset.loc[dataset["InvoiceNo"].str.isnumeric().isnull()]

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

## ● Crear una variable (columna) llamada "Amount", que sea el resultado de la multiplicación de las variables (columnas) "Quantity" y "UnitPrice"

In [29]:
dataset["Amount"]=dataset["Quantity"]*dataset["UnitPrice"]

## ● Determine los montos totales, gastados por todos los clientes, para el año 2010 y 2011

In [37]:
dataset["Year"]=dataset["InvoiceDate"].dt.year
dataset.groupby("Year")["Amount"].sum()

## ● A partir de la variable (columna) llamada "Amount", determine los 5 montos más altos que más gastaron los clientes

In [41]:
ordenar=dataset.sort_values("Amount",ascending=False)
ordenar.head()

       InvoiceNo  StockCode  ...     Amount  Year
540421    581483      23843  ...  168469.60  2011
61619     541431      23166  ...   77183.60  2011
222680    556444      22502  ...   38970.00  2011
15017     537632  AMAZONFEE  ...   13541.33  2010
299982   A563185          B  ...   11062.06  2011

[5 rows x 10 columns]